FONT_MAP = {
    'a': 'ᴧ', 'b': 'в', 'c': 'ᴄ', 'd': 'ᴅ', 'e': 'є',
    'f': 'ғ', 'g': 'ɢ', 'h': 'н', 'i': 'i', 'j': 'ᴊ',
    'k': 'ᴋ', 'l': 'ʟ', 'm': 'ϻ', 'n': 'η', 'o': 'σ',
    'p': 'ᴩ', 'q': 'ǫ', 'r': 'ʀ', 's': 's', 't': 'ᴛ',
    'u': 'ᴜ', 'v': 'ᴠ', 'w': 'ᴡ', 'x': 'x', 'y': 'ʏ', 'z': 'ᴢ',
    'A': 'ᴧ', 'B': 'ʙ', 'C': 'ᴄ', 'D': 'ᴅ', 'E': 'є',
    'F': 'ғ', 'G': 'ɢ', 'H': 'н', 'I': 'ɪ', 'J': 'ᴊ',
    'K': 'ᴋ', 'L': 'ʟ', 'M': 'ϻ', 'N': 'η', 'O': 'σ',
    'P': 'ᴩ', 'Q': 'ǫ', 'R': 'ʀ', 'S': 's', 'T': 'ᴛ',
    'U': 'ᴜ', 'V': 'ᴠ', 'W': 'ᴡ', 'X': 'x', 'Y': 'ʏ', 'Z': 'ᴢ',
}


def fancy(text: str) -> str:
    return "".join(FONT_MAP.get(c, c) for c in text)
